# ------------------------------------------------------------------------------
# squarematrix.py - содержит описание обобщающей квадратной матрицы
# ------------------------------------------------------------------------------

class SquareMatrix:
    # Ввод параметров обычного квадратного массива из потока
    def ReadSquareMatrix(self, n, values):
        pass

    # Вывод параметров обычного квадратного массива
    def Print(self):
        pass

    # Вывод параметров обычного квадратного массива в поток
    def Write(self, ostream):
        pass

    # Вычисление среднего арифметического значений квадратной матрицы
    def Average(self):
        pass
